#**********************************************************************
#**********************************************************************
#**                                                                  **
#**        (C)Copyright 1985-2017, American Megatrends, Inc.         **
#**                                                                  **
#**                       All Rights Reserved.                       **
#**                                                                  **
#**         5555 Oakbrook Pkwy, Suite 200, Norcross, GA 30093        **
#**                                                                  **
#**                       Phone: (770)-246-8600                      **
#**                                                                  **
#**********************************************************************
#**********************************************************************

/=#

#ifndef x-AMI
#langdef   x-AMI "x-AMI"    // AMI Configuration Language
#endif
#langdef   en-US "English"        // English

#string STR_ERRMGMT_FORM                        #language en-US  "Error Management"
#string STR_ERRMGMT_FORM_HELP                   #language en-US  "Error Management settings."
#string STR_LOG_TO_GPNV                         #language en-US  "Log Errors to GPNV"
#string STR_LOG_TO_GPNV_HELP                    #language en-US  "Platform Errors logging to GPNV"

#string STR_PLATFORM_FIRST_ERROR_HANDLING       #language en-US  "Platform First Error Handling"
                                                #language x-AMI  "PlatformFirstErrorHandling"
#string STR_PLATFORM_FIRST_ERROR_HANDLING_HELP  #language en-US  "Enable/Disable PFEH"

#string STR_MCA_ERR_THRESH_COUNT                #language en-US  "MCA Error Threshold Count"
                                                #language x-AMI  "MCAErrorThresholdCount"
#string STR_MCA_ERR_THRESH_COUNT_HELP           #language en-US  "MCA Error Threshold Count, 0-Disable Error"
#string STR_0                                   #language en-US  "0"
#string STR_1                                   #language en-US  "1"
#string STR_5                                   #language en-US  "5"
#string STR_10                                  #language en-US  "10"
#string STR_100                                 #language en-US  "100"
#string STR_1000                                #language en-US  "1000"

#string AMD_CBS_STR_AUTO                                                        #language en-US    "Auto"
#string AMD_CBS_STR_ENABLED                                                     #language en-US    "Enabled"
#string AMD_CBS_STR_DISABLED                                                    #language en-US    "Disabled"

#string AMD_CBS_STR_DRAM_ADDRESS_COMMAND_PARITY   								#language en-US    "DRAM Address/Command Parity with Replay"
                                                                                #language x-AMI    "RAS0DRAMAddress/CommandParitywithReplay02"
#string AMD_CBS_STR_DRAM_WRITE_CRC   											#language en-US    "DRAM Write Data CRC with Replay"
                                                                                #language x-AMI    "DRAMWriteDataCRCwithReplay"

#** APCB_TOKEN_CBS_DBG_MEM_RCD_PARITY_DDR4 
#** CbsDbgMemRcdParityDdr4
#string AMD_CBS_STR_RCD_PARITY                                                  #language en-US    "RCD Parity"
                                                                                #language x-AMI    "RCDParity"
#string AMD_CBS_STR_RCD_PARITY_HELP                                             #language en-US    "RCD Parity (RDimmParEn)"

#** APCB_TOKEN_CBS_DBG_MEM_ADDR_CMD_PARITY_RETRY_DDR4
#** CbsDbgMemAddrCmdParityRetryDdr4
#string AMD_CBS_STR_DRAM_ADDRESS_COMMAND_PARITY_RETRY                           #language en-US    "DRAM Address Command Parity Retry"
                                                                                #language x-AMI    "DRAMAddressCommandParityRetry"
#string AMD_CBS_STR_DRAM_ADDRESS_COMMAND_PARITY_RETRY_HELP                      #language en-US    "DRAM Address Command Parity Retry"

#** APCB_TOKEN_CBS_DBG_MEM_ADDR_CMD_PARITY_ERROR_MAX_RETRY_DDR4
#** CbsDbgMemAddrCmdParityErrorMaxReplayDdr4
#string AMD_CBS_STR_MAX_PARITY_ERROR_REPLAY                                     #language en-US    "Max Parity Error Replay"
                                                                                #language x-AMI    "MaxParityErrorReplay"
#string AMD_CBS_STR_MAX_PARITY_ERROR_REPLAY_HELP                                #language en-US    "Max Parity Error Replay. Valid range 2 to 8."

#** APCB_TOKEN_CBS_DBG_MEM_CTRLLER_WR_CRC_EN_DDR4
#** CbsDbgMemCtrllerWrCrcEnDdr4
#string AMD_CBS_STR_WRITE_CRC_ENABLE                                            #language en-US    "Write CRC Enable"
                                                                                #language x-AMI    "WriteCRCEnable"
#string AMD_CBS_STR_WRITE_CRC_ENABLE_HELP                                       #language en-US    "Write CRC Enable"

#** APCB_TOKEN_CBS_DBG_MEM_WRITE_CRC_RETRY_DDR4
#** CbsDbgMemWriteCrcRetryDdr4
#string AMD_CBS_STR_DRAM_WRITE_CRC_ENABLE_AND_RETRY_LIMIT                       #language en-US    "DRAM Write CRC Enable and Retry Limit"
                                                                                #language x-AMI    "DRAMWriteCRCEnableandRetryLimit"
#string AMD_CBS_STR_DRAM_WRITE_CRC_ENABLE_AND_RETRY_LIMIT_HELP                  #language en-US    "DRAM Write CRC Enable and Retry Limit"

#** APCB_TOKEN_CBS_DBG_MEM_WRITE_CRC_ERROR_MAX_REPLAY_DDR4
#** CbsDbgMemWriteCrcErrorMaxReplayDdr4
#string AMD_CBS_STR_MAX_WRITE_CRC_ERROR_REPLAY                                  #language en-US    "Max Write CRC Error Replay"
                                                                                #language x-AMI    "MaxWriteCRCErrorReplay"
#string AMD_CBS_STR_MAX_WRITE_CRC_ERROR_REPLAY_HELP                             #language en-US    "Max Write CRC Error Replay. Valid range 2 to 8."

#string STR_MCA_MEM_ERR_THRESH_COUNT                                            #language en-US  "Memory Error Threshold Count"
                                                                                #language x-AMI  "MemoryErrorThresholdCount"
#string STR_MCA_MEM_ERR_THRESH_COUNT_HELP                                       #language en-US  "Memory Error Threshold Count, Valid data Range(0~4094), When this option set to 0, OS and BMC won't report error message"

#string STR_MCA_PRO_ERR_THRESH_COUNT                                            #language en-US  "Processor Error Threshold Count"
                                                                                #language x-AMI  "ProcessorErrorThresholdCount"
//<Lvshh001-20210513 Optimized Memory Leaky Bucket_3 +>
#string STR_MCA_PRO_ERR_THRESH_COUNT_HELP_BAIDU                                 #language en-US  "Processor Error Threshold Count, Valid data Range(1~4094)"
//<Lvshh001-20210513 Optimized Memory Leaky Bucket_3 ->

#string STR_MEM_LEAKY_BUCKET_INTERVAL                                           #language en-US  "Memory Leaky Bucket Interval"                                              
                                                                                #language x-AMI  "MemoryLeakyBucketInterval"
                                                      
//<Chendl001-201806719 Corrected Memory Leaky Bucket Interval Help info +>  
#string STR_MEM_LEAKY_BUCKET_INTERVAL_MINUTES_HELP                              #language en-US  "Number of minutes to trigger Memory Leaky Bucket Function, Valid data Range(0~0xffffffff), 0 = Disabled Memory Leaky Bucket Function"
//<Chendl001-20180719 Corrected Memory Leaky Bucket Interval Help info ->  

#string STR_MEM_LEAKY_BUCKET_DROP_OUT_COUNTER                                   #language en-US  "Memory Leaky Bucket Drop Out Count"
                                                                                #language x-AMI  "MemoryLeakyBucketDropOutCount"
#string STR_MEM_LEAKY_BUCKET_DROP_OUT_COUNTER_HELP                              #language en-US  "Number of correctable error need dropped out, Valid data Range(1~4094)"

//<Wangyia001-20181017  Modify as Baidu BIOS spec v1.1 +>
#string STR_MCA_MEM_ERR_THRESH_COUNT_BAIDU            #language en-US  "Memory CE Accumulation Threshold"
                                                      #language x-UEFI-AMI  "RAS014"
#string STR_MCA_MEM_ERR_THRESH_COUNT_HELP_BAIDU       #language en-US  "Memory CE Accumulation Threshold, Valid data Range(0~10000). 0 = Disable Error Report"
#string STR_MCA_MEM_CE_STORM_THRESH_BAIDU             #language en-US  "Memory CE Storm Threshold"
//<Lvshh001-20210513 Optimized Memory Leaky Bucket_3 +>
#string STR_MCA_MEM_CE_STORM_THRESH_HELP_BAIDU        #language en-US  "Memory CE Storm Threshold"
//<Lvshh001-20210513 Optimized Memory Leaky Bucket_3 ->
#string STR_1                                         #language en-US  "1"
#string STR_60                                        #language en-US  "60"
#string STR_120                                       #language en-US  "120"
#string STR_240                                       #language en-US  "240"
#string STR_500                                       #language en-US  "500"
#string STR_1200                                      #language en-US  "1200"
#string STR_1500                                      #language en-US  "1500"
#string STR_2000                                      #language en-US  "2000"
#string STR_5000                                      #language en-US  "5000"
#string STR_10000                                     #language en-US  "10000"
//<Wangyia001-20181017  Modify as Baidu BIOS spec v1.1 ->

#**********************************************************************
#**********************************************************************
#**                                                                  **
#**        (C)Copyright 1985-2017, American Megatrends, Inc.         **
#**                                                                  **
#**                       All Rights Reserved.                       **
#**                                                                  **
#**         5555 Oakbrook Pkwy, Suite 200, Norcross, GA 30093        **
#**                                                                  **
#**                       Phone: (770)-246-8600                      **
#**                                                                  **
#**********************************************************************
#**********************************************************************
